 // явное указание ключей в PHP

 // при необходимости ключи можно указать явным образом

 $arr = [];
 $arr[0] = 'a';
 $arr[1] = 'b';
 $arr[2] = 'c';

 print_r($arr);

 /*
 Array
 (
 [0] => a
 [1] => b
 [2] => c
 ) */

 // Ключи могут быть не только числовыми, но и строковыми

 $arr['a'] = 1;
 $arr['b'] = 2;
 $arr['c'] = 3;

 print_r($arr);

 /* Array
 (
 [0] => a
 [1] => b
 [2] => c
 [a] => 1
 [b] => 2
 [c] => 3
 ) */

 echo "Задача 1" . PHP_EOL;
 // Пусть дан пустой массив:

 $arr = [];

 /* Описанным способом в ключ 'year' запишите текущий год,
 в ключ 'month' - текущий месяц, а в ключ 'day' - текущий
 день. */

 $arr['year'] = 2025;
 $arr['month'] = 7;
 $arr['day'] = 12;

 print_r($arr);
 /*
 Array
 (
 [year] => 2025
 [month] => 7
 [day] => 12
 ) */