<?php

// №1⊗ppPmCdLOr
// Не запуская код определите, что выведется на экран:


$num1 = -10;
$num2 = -10;

if ($num1 >= 0 or $num2 >= 0) {
    echo '+++';
} else {
    echo "\nвыведется ложь";
}

// №2⊗ppPmCdLOr

// Не запуская код определите, что выведется на экран:


$num1 = 0;
$num2 = 0;

if ($num1 >= 0 or $num2 >= 0) {
    echo "\nвторое условие выполнится";
} else {
    echo '---';
}

// №3⊗ppPmCdLOr

// Не запуская код определите, что выведется на экран:


$num1 = 0;
$num2 = 5;

if ($num1 >= 0 or $num2 >= 0) {
    echo "\nтретье условие выполнится";
} else {
    echo '---';
}

// №4⊗ppPmCdLOr

// Не запуская код определите, что выведется на экран:


$num1 = 5;
$num2 = 5;

if ($num1 >= 0 or $num2 >= 0) {
    echo "\nчетвёртое условие выполнится";
} else {
    echo '---';
}

// №5⊗ppPmCdLOr

// Не запуская код определите, что выведется на экран:


$num1 = -5;
$num2 = 15;

if ($num1 >= 0 or $num2 >= 0) {
    echo "\n5-ok";
} else {
    echo '---';
}

// №6⊗ppPmCdLOr

// Не запуская код определите, что выведется на экран:


$num = 1;

if ($num == 0 or $num == 1) {
    echo "\n6-ok";
} else {
    echo '---';
}

// №7⊗ppPmCdLOr

// Не запуская код определите, что выведется на экран:


$num = 2;

if ($num == 0 or $num == 1) {
    echo '+++';
} else {
    echo "\n7-ok";
}

// №8⊗ppPmCdLOr

// Не запуская код определите, что выведется на экран:


$num = 2;

if (
    $num == 0 or $num == 1 or $num
    == 2
) {
    echo "\n8-ok";
} else {
    echo '---';
}
