<?php

// №1⊗ppPmCdBShI
// Перепишите следующий код с использованием сокращенного сравнения:


$test = true;

if ($test) {
    echo '+++';
} else {
    echo '---';
}

// №2⊗ppPmCdBShI
// Перепишите следующий код с использованием сокращенного сравнения:


$test = true;

if (!$test) {
    echo '+++';
} else {
    echo '---';
}

// №3⊗ppPmCdBShI
// Перепишите следующий код с использованием сокращенного сравнения:


$test = true;

if (!$test) {
    echo '+++';
} else {
    echo '---';
}

// №4⊗ppPmCdBShI
// Перепишите следующий код с использованием сокращенного сравнения:


$test = true;

if ($test) {
    echo '+++';
} else {
    echo '---';
}
