<?php

// №1⊗ppPmCdLO
// Пусть даны следующие переменные:

$a = 2 * (3 - 1);
$b = 6 - 2;

// Используя оператор ==, узнайте, равны ли значения этих переменных или нет.

var_dump($a == $b);

// №2⊗ppPmCdLO
// Пусть даны следующие переменные:


$a = 5 * (7 - 4);
$b = 1 + 2 + 7;

// Используя оператор >, узнайте, больше ли переменная $a, чем $b.

var_dump($a > $b);

// №3⊗ppPmCdLO
// Пусть даны следующие переменные:


$a = 2 ** 4;
$b = 4 ** 2;

// Используя оператор !=, узнайте, разные ли значения этих переменных или нет.

var_dump($a != $b);
