<?php

include 'functions.php';

// №1⊗ppPmLpSF
// С помощью цикла сформируйте строку, заполненную 5-тью дефисами.
task(1);
$str = "";
for ($i = 0; $i < 5; $i++) {
    $str .= "-";
}
echo $str;


// №2⊗ppPmLpSF
// С помощью цикла сформируйте строку '123456789'.
task(2);
$str = "";
for ($i = 1; $i < 10; $i++) {
    $str .= $i;
}
echo $str;


// №3⊗ppPmLpSF
// С помощью цикла сформируйте строку '987654321'.
task(3);
$str = "";
for ($i = 9; $i >= 1; $i--) {
    $str .= $i;
}
echo $str;

// №4⊗ppPmLpSF
// С помощью цикла сформируйте строку '-1-2-3-4-5-6-7-8-9-'.
task(4);
$str = "";
for ($i = 0; $i <= 9; $i++) {
    if ($i === 0) $str .= "-";
    else $str .= "$i-";
}
echo $str;
