<?php

include "functions.php";

// №1⊗ppPmMdMA
// Дан следующий массив:
task(1);
$arr = [
    ['a', 'b', 'c'], // 0
    ['d', 'e', 'f'], // 1
    ['g', 'h', 'i'], // 2
    ['j', 'k', 'l'], // 3
];

// Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'.

var_dump($arr[3][2]); // l
var_dump($arr[1][1]); // e
var_dump($arr[2][0]); // g
var_dump($arr[0][0]); // a


// №2⊗ppPmMdMA
// Дан следующий массив:
task(2);

$arr = [
    [1, 2], // 0
    [3, 4], // 1
    [5, 6] // 2
];

// Найдите сумму всех его элементов.

$sum = $arr[0][0] + $arr[0][1] + $arr[1][0] + $arr[1][1] + $arr[2][0] + $arr[2][1];

var_dump($sum);
