<?php

include "functions.php";

// №1⊗ppPmMdArF
// Сформируйте с помощью двух вложенных циклов следующий массив:
task(1);
$arr = [];
// [
//     [1, 2, 3, 4, 5],
//     [1, 2, 3, 4, 5],
//     [1, 2, 3, 4, 5]
// ]; 
for ($i = 0; $i < 3; $i++) {
    for ($j = 0; $j < 5; $j++) {
        $arr[$i][$j] = $j + 1;
    }
}
print_r($arr);

// №2⊗ppPmMdArF
// Сформируйте с помощью двух вложенных циклов следующий массив:

// [
//     ['x', 'x', 'x', 'x'], 
//     ['x', 'x', 'x', 'x'],
//     ['x', 'x', 'x', 'x']
// ] 

task(2);
$arr = [];
for ($i = 0; $i < 3; $i++) {
    for ($j = 0; $j < 4; $j++) {
        $arr[$i][$j] = 'x';
    }
}
print_r($arr);

// №3⊗ppPmMdArF
// Сформируйте с помощью трех вложенных циклов следующий массив:

// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]
task(3);
$arr = [];
for ($i = 0; $i < 3; $i++) {
    for ($j = 0; $j < 2; $j++) {
        for ($k = 0; $k < 5; $k++) {
            $arr[$i][$j][$k] = $k + 1;
        }
    }
}

var_dump($arr);
