<?php

include "functions.php";

// №1⊗ppPmScRA
task(1);
// Расскажите, каким будет результат выполнения кода:

// $arr1 = [1, 2, 3, 4, 5];

// $arr2 = $arr1;
// $arr2[0] = '!';

// echo $arr1[0]; // 1
// echo $arr2[0]; // !

// №2⊗ppPmScRA
task(2);
// Расскажите, каким будет результат выполнения кода:


// $arr1 = [1, 2, 3, 4, 5];

// $arr2 = &$arr1;
// $arr1[0]++;

// echo $arr1[0]; // 2
// echo $arr2[0]; // 2

// №3⊗ppPmScRA
task(3);
// Расскажите, каким будет результат выполнения кода:


$arr1 = [1, 2, 3, 4, 5];

$arr2 = &$arr1;

$arr1[0]++; // 2
$arr2[0]++; // 3

echo $arr1[0]; // 3
echo $arr2[0]; // 3
