<?php

// Дана строка с датами:
$str = '2023-10-29 2024-11-30 2025-12-31';
// Найдите все даты, отделив год, месяц и день в отдельные карманы.
preg_match_all("#(\d{4})-(\d{2})-(\d{2})#", $str, $res);
print_r($res);

/* 

Array
(
    [0] => Array
        (
            [0] => 2023-10-29
            [1] => 2024-11-30
            [2] => 2025-12-31
        )

    [1] => Array
        (
            [0] => 2023
            [1] => 2024
            [2] => 2025
        )

    [2] => Array
        (
            [0] => 10
            [1] => 11
            [2] => 12
        )

    [3] => Array
        (
            [0] => 29
            [1] => 30
            [2] => 31
        )

)

*/