 // ИСПОЛЬЗОВАНИЕ ПЕРЕМЕННЫХ В PHP

 // shift + option(alt) + A - горячая клавиша для создания блочного комментария

 /* Для того, чтобы записать что-либо в переменную используется
 знак =, который называется знаком присваивания. Давайте, например,
 запишем в переменную $a число 3 */

 $a = 3;

 /* а теперь выведем содержимое переменной $a на экран
 с помощью команды echo */

 echo $a; // выведет на экран число 3
 echo '<br>';

 /* Задача 1
 Создайте переменную $num и присвойте ей значение 123.
 Выведите значение этой переменной на экран с помощью команды echo. */

 // решение
 $num = 123;
 echo $num;