 // Длина массива в PHP

 /* Длина массива находится с помощью функции count: */

 $arr = [1, 2, 3];
 echo count($arr) . PHP_EOL; // выведет 3

 echo "Task 1" . PHP_EOL;

 // Выведите на экран количество элементов в этом массиве.
 $arr = ['a', 'b', 'c', 'd', 'e'];

 echo "Длина массива: " . count($arr) . " элементов" . PHP_EOL;

 echo "Task 2" . PHP_EOL;

 // Выведите на экран количество элементов в этом массиве.
 $arr = ['a' => 1, 'b' => 2, 'c'
 => 3, 'd' => 4];
 echo "Длина массива: " . count($arr) . " элементов" . PHP_EOL;