<?php

include "functions.php";

// №1⊗ppPmRgSSE
task(1);
// Дана строка:
$str = 'x[]z x{}z x.z x()z';
// Напишите регулярку, которая найдет все слова по шаблону: 
// буква 'x', затем любое количество любых скобок, затем буква 'z'.
echo preg_replace("#x[\[({][\]})]z#", "___", $str);


// №2⊗ppPmRgSSE
task(2);
// Дана строка:
$str = '[abc] {abc} abc (abc) [abc]';
// Напишите регулярку, которая найдет строки в любых 
// скобках и заменят их на '!'.
echo preg_replace("#[\[({].*?[\])}]#", "___", $str);
